//==================================================================//
// 数値を16進数で文字列化
// マイナス値の処理は無い
//==================================================================//
void HexToStr (unsigned int num,char *s) {
        int q = 0;
        int l = num;
        int minus = 0;
        while(l/=16){ q++; }
        q = q;
        for(int i=q;i>=0;i--)
        {
            int m = num % 16;
            if(m>=0 && m<=9)
                s[i] = m + '0';
            else
                s[i] = m + ('A'-10);
            num = num/16;
        }
        s[q+1] = '\0';
}
