//==================================================================//
// 数値を10進数で文字列化
//==================================================================//
void IntToStr (int num,char *s) {
        int q = 0;
        int l = num;
        int minus = 0;
        while(l/=10){ q++; }

        if(num<0){
            num *= -1;
            s[0] = '-';
            minus = 1;
        }
        q = q +minus;
        for(int i=q;i>=0+minus;i--)
        {
            int m = num % 10;
            s[i] = m + '0';
            num = num/10;
        }
        s[q+1] = '\0';
}